# Excel'den bir Data Sets ile calisalim

In [5]:
import pandas as pd

## CSV formati; ',' ile ayrilmis verilerden olusur!!!!

pd.read_csv('iris.csv') # Bu kod satiri csv uzantilari okur

### Excel dosyani okuyoruz;

In [6]:
dataFrame = pd.read_excel('maas.xlsx')

In [7]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   200  20.0    Yazilim
1     Zeynep   150  23.0      Satis
2     Mehmet   300  30.0        NaN
3      Ahmet   450  40.0  Pazarlama
4      Atlas   600   NaN     Finans
5      Fatma   250  28.0      Hukuk

### NaN olan verileri silmek istersek;

In [8]:
notNanDataFrame = dataFrame.dropna(axis=0)

In [9]:
notNanDataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   200  20.0    Yazilim
1     Zeynep   150  23.0      Satis
3      Ahmet   450  40.0  Pazarlama
5      Fatma   250  28.0      Hukuk

In [10]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   200  20.0    Yazilim
1     Zeynep   150  23.0      Satis
2     Mehmet   300  30.0        NaN
3      Ahmet   450  40.0  Pazarlama
4      Atlas   600   NaN     Finans
5      Fatma   250  28.0      Hukuk

Goruldugu gibi dropna() fonksiyonu yeni bir data frame'de donduruyor. Gecerli degiskende kalici degisiklik yapmiyor.

### NaN olan degerleri sildikten sonra ki Data Frame'i Excel'e kayit etmek istersek;

In [11]:
notNanDataFrame.to_excel('yeniMaas.xlsx')